In [2]:
import pandas as pd

In [3]:
# reading the csv file
df_exams = pd.read_csv("StudentsPerformance.csv")

# Selecting one column

In [5]:
# select a column with [] (preferred method)
df_exams['gender']

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [6]:
#heck out the data type of a column
type(df_exams['gender'])

pandas.core.series.Series

In [8]:
# series: attributes and methods
df_exams['gender'].index
df_exams['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

## Syntax 2

In [9]:
# select a column with .
df_exams.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [13]:
# pitfalls: select a column with . 
# doesn't work with column titles that have spaces
df_exams.math_score

AttributeError: 'DataFrame' object has no attribute 'math_score'

In [15]:
df_exams['math score']

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math score, Length: 1000, dtype: int64

# Selection two or more columns

In [18]:
# select 2 columns using [[]]
df_exams[['gender','math score']]

     gender  math score
0    female          72
1    female          69
2    female          90
3      male          47
4      male          76
..      ...         ...
995  female          88
996    male          62
997  female          59
998  female          68
999  female          77

[1000 rows x 2 columns]

In [19]:
# Check out the data type of the selection
type(df_exams[['gender','math score']])

pandas.core.frame.DataFrame

In [21]:
# Select two or more columns with [[]]
df_exams[['gender', 'math score', 'reading score', 'writing score']]

     gender  math score  reading score  writing score
0    female          72             72             74
1    female          69             90             88
2    female          90             95             93
3      male          47             57             44
4      male          76             78             75
..      ...         ...            ...            ...
995  female          88             99             95
996    male          62             55             55
997  female          59             71             65
998  female          68             78             77
999  female          77             86             86

[1000 rows x 4 columns]

In [ ]:
# we can't select 2 or more columns with the "."
df.exams.'gender', 'match score'